Cases/DNS/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   psi;
//    method            CCM;
}

chemistry       on;

initialChemicalTimeStep 1e-10;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          seulex;
    absTol          1e-12;
    relTol          1e-1;
}

CCM
{
    ratioOxygenToCarbonElementInFuel 0;
    min:max:SpanZoneJe 0 20 0.01;
    min:max:SpanZoneT 300 3000 5;
    min:max:SpanZoneXi 0 1 0.025;
    chemicallyFrozenT 300;
    maxFlammabilityPhi 20;
    // new version
    CCMspecies
    {
        C7H16           0 1 0.001;
        NH3             0 1 0.001;
        N2              0 1 0.001;
    }
}


#include "reactions"

// ************************************************************************* //
differentialDiffusion on;
thermalDiffusion off;

Prt  Prt [0 0 0 0 0] 0.7;
Sct  Sct [0 0 0 0 0] 0.7;

